using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
1. а) Дописать структуру Complex, добавив метод вычитания комплексных чисел.
Продемонстрировать работу структуры.
б) Дописать класс Complex, добавив методы вычитания и произведения чисел. Проверить
работу класса.
2. а) С клавиатуры вводятся числа, пока не будет введён 0 (каждое число в новой строке).
Требуется подсчитать сумму всех нечётных положительных чисел. Сами числа и сумму
© geekbrains.ru 14
вывести на экран, используя tryParse.
б) Добавить обработку исключительных ситуаций на то, что могут быть введены некорректные
данные. При возникновении ошибки вывести сообщение.
Напишите соответствующую функцию.
3. *Описать класс дробей — рациональных чисел, являющихся отношением двух целых чисел.
Предусмотреть методы сложения, вычитания, умножения и деления дробей. Написать
программу, демонстрирующую все разработанные элементы класса. Достаточно решить 2
задачи. Все программы сделать в одном решении.
** Добавить проверку, чтобы знаменатель не равнялся 0. Выбрасывать исключение
ArgumentException("Знаменатель не может быть равен 0");
** Добавить упрощение дробей.
*/

namespace HomeTask3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("выполнено 2 и 3 задание");
           
        } 
    }
}
